test/Lagrangian/transfers/constant/Lagrangian/droplets/LagrangianModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/Lagrangian/droplets";
    object      LagrangianModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

injection
{
    type        manualInjection;
    positions   (($x 0 0.499999)) [m];
}

gravity
{
    type        gravity;
}

drag
{
    type        SchillerNaumannDrag;
}

constantFluxCarrierTransfer
{
    type        constantFluxCarrierTransfer;
    volumeFlux  $volumeFlux;
}

// ************************************************************************* //
